<?php

/*
 * This file is part of the godruoyi/laravel-tencent007-captcha.
 *
 * (c) Godruoyi <godruoyi@gmail.com>
 *
 * This source file is subject to the MIT license that is bundled.
 */

return [
    /*
    |--------------------------------------------------------------------------
    | 腾讯防水墙 APPID/SECRET
    |--------------------------------------------------------------------------
    |
    | 更多配置请查看文档 https://007.qq.com
    |
    */
    'appid' => env('TENCENT007_APPID', ''),
    'secret' => env('TENCENT007_SECRET', ''),

    /*
    |--------------------------------------------------------------------------
    | 恶意等级 0-100（该配置仅在使用 ThrottleRequests 中间件时有效）
    |--------------------------------------------------------------------------
    |
    | 若用户完成验证后的恶意等级大于等于该配置的值，则不允许通过，
    |
    */
    'level' => env('TENCENT007_LEVEL', 70),

    /*
    |--------------------------------------------------------------------------
    | 是否开启缓存（该配置仅在使用 ThrottleRequests 中间件时有效）
    |--------------------------------------------------------------------------
    |
    | 默认为 0 即不开启，单位/小时，表示用户在首次通过防水墙验证后，接下来的多长时间内
    | 可以不用再次验证。
    |
    */
    'cache' => env('TENCENT007_CACHE', 0),

    /*
    |--------------------------------------------------------------------------
    | 前端请求参数（该配置仅在使用 ThrottleRequests 中间件时有效）
    |--------------------------------------------------------------------------
    |
    | 默认情况下我们会从请求中获取参数名为 ticket、randstr 的参数值，你可以通过配置
    | 这里的值来改变他们。
    |
    */
    'request_key_map' => [
        // ticket => 'custom_ticket_field'

        'ticket' => 'ticket',
        'randstr' => 'randstr',
    ],
];
